/*

    Задача 68. Написать программу вычисления функции Аккермана с помощью рекурсии.
    Даны два неотрицательных числа m и n

    m = 2, n = 3 -> A(m,n) = 9 
*/

int A(int m, int n)
{
    return (m == 0) ?
            n + 1 :
            (m != 0 && n == 0) ?
            A(m - 1, 1) :
            A(m - 1, A(m, n - 1));
}
int m = 2, n = 3;
int result = A(m, n);

Console.WriteLine($"m = {m}, n = {n} -> A({m},{n}) = {result}");